In [39]:
import pandas as pd

In [2]:
data = [['harry',34],['jack',78],['jill',68],['kklr',99],['hero',90]]

In [3]:
data

[['harry', 34], ['jack', 78], ['jill', 68], ['kklr', 99], ['hero', 90]]

In [4]:
pd.DataFrame(data,columns=["Name","Marks"])

    Name  Marks
0  harry     34
1   jack     78
2   jill     68
3   kklr     99
4   hero     90

In [8]:
data = {"a":[1,4,5],"b":[56,5,4]}

In [9]:
data

{'a': [1, 4, 5], 'b': [56, 5, 4]}

In [10]:
df =pd.DataFrame(data)

In [11]:
df

   a   b
0  1  56
1  4   5
2  5   4

In [12]:
import numpy as np

In [13]:
arr = np.array([[1,3],[5,6]])

In [14]:
df=pd.DataFrame(arr,columns=["A","B"])

In [16]:
df

   A  B
0  1  3
1  5  6

In [40]:
df =pd.read_excel("data.xlsx")

In [41]:
df

      Name School  Marks
0   Kartik    THB     89
1  Shubham    ERF     78
2    Rohit    SRK     65
3    Kapur    SSK     78
4    Akash    DDD     89
5    Rohan    DDD     99
6    Rishi    DKD     87
7     Alex    KPS     74

In [35]:
df = pd.read_excel("data.xlsx")

In [36]:
df

      Name School  Marks
0   Kartik    THB     89
1  Shubham    ERF     78
2    Rohit    SRK     65
3    Kapur    SSK     78
4    Akash    DDD     89
5    Rohan    DDD     99
6    Rishi    DKD     87
7     Alex    KPS     74

In [46]:
df = pd.read_csv("data.csv")

In [47]:
df

      Name School  Marks
0   Kartik    THB     89
1  Shubham    ERF     78
2    Rohit    SRK     65
3    Kapur    SSK     78
4    Akash    DDD     89
5    Rohan    DDD     99
6    Rishi    DKD     87
7     Alex    KPS     74

In [51]:
df = pd.read_json("data.json")

JSONDecodeError: Expecting value: line 10 column 1 (char 87)

In [54]:
url = "https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv"
df = pd.read_csv(url)

In [55]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [58]:
df.head() # First 5 rows

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [59]:
df.tail()# Last 5 rows

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [60]:
df.info() # Column info: types, non-nulls

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [61]:
df.describe()# Stats for numeric columns

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [63]:
df.columns# List of column names

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [64]:
df.shape # (rows, columns)

(244, 7)